const categoryMap: { [key: string]: string } = {
  "العناية-بالوجه": "العناية بالوجه",
  "العناية-بالجسم": "العناية بالجسم",
  "العناية-بالشعر": "العناية بالشعر",
  "النظافة-الشخصية": "النظافة الشخصية",
  "الأم-والطفل": "الأم والطفل",
  "الحماية-من-الشمس": "الحماية من الشمس",
  "رجال": "رجال",
  "الزيوت-العطرية": "الزيوت العطرية",
  "الأعشاب-والمشروبات": "الأعشاب والمشروبات",
  "العسل-ومنتجات-النحل": "العسل ومنتجات النحل",
  "المكملات-الغذائية": "المكملات الغذائية",
  "مستحضرات-التجميل-العضوية": "مستحضرات التجميل العضوية",
};

export const getCategoryNameFromSlug = (slug: string): string => {
  return categoryMap[slug] || slug;
};